In [1]:
import pandas as pd
import numpy as np

In [2]:
persistence_14 = pd.read_excel('Persistence Count.xlsx',sheet_name='2014')

In [3]:
persistence_15 = pd.read_excel('Persistence Count.xlsx',sheet_name='2015')

In [4]:
persistence_16 = pd.read_excel('Persistence Count.xlsx',sheet_name='2016')

In [5]:
persistence_df = pd.merge(persistence_14, persistence_15,how='outer',on='Institution')

In [6]:
persistence_df = pd.merge(persistence_df, persistence_16,how='outer',on='Institution')

In [7]:
persistence_df.columns = ['Institution', 'persist 2014', 'persist 2015', 'persist 2016']

In [17]:
persistence_df.head()

                    Institution  persist 2014  persist 2015  persist 2016
0       Angelo State University         798.0         889.0           949
1              Lamar University         828.0         963.0           931
2   Midwestern State University         573.0         571.0           477
3   Prairie View A&M University        1060.0        1118.0          1296
4  Sam Houston State University        1940.0        1917.0          2036

In [8]:
cohort_df = pd.read_excel('Cohort Count.xlsx',sheet_name='Univ.Persist1yr')

In [15]:
cohort_df.head()

                    Institution  Cohort 2014  Cohort 2015  Cohort 2016
0       Angelo State University       1285.0       1336.0       1452.0
1              Lamar University       1411.0       1505.0       1457.0
2   Midwestern State University        834.0        818.0        728.0
3   Prairie View A&M University       1602.0       1614.0       1834.0
4  Sam Houston State University       2449.0       2514.0       2667.0

In [13]:
df = pd.merge(persistence_df, cohort_df, how='outer',on='Institution').fillna(0)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 37 entries, 0 to 36
Data columns (total 7 columns):
Institution     37 non-null object
persist 2014    37 non-null float64
persist 2015    37 non-null float64
persist 2016    37 non-null float64
Cohort 2014     37 non-null float64
Cohort 2015     37 non-null float64
Cohort 2016     37 non-null float64
dtypes: float64(6), object(1)
memory usage: 2.3+ KB

In [26]:
df['rate 2014'] = np.zeros(37); df['rate 2015'] = np.zeros(37); df['rate 2016'] = np.zeros(37)

In [27]:
df.head()

,Institution,persist 2014,persist 2015,persist 2016,Cohort 2014,Cohort 2015,Cohort 2016,rate 2014,rate 2015,rate 2016
0,Angelo State University,798.0,889.0,949.0,1285.0,1336.0,1452.0,0.0,0.0,0.0
1,Lamar University,828.0,963.0,931.0,1411.0,1505.0,1457.0,0.0,0.0,0.0
2,Midwestern State University,573.0,571.0,477.0,834.0,818.0,728.0,0.0,0.0,0.0
3,Prairie View A&M University,1060.0,1118.0,1296.0,1602.0,1614.0,1834.0,0.0,0.0,0.0
4,Sam Houston State University,1940.0,1917.0,2036.0,2449.0,2514.0,2667.0,0.0,0.0,0.0

In [33]:
for index, row in df.iterrows():
    if row['persist 2014'] != 0 and row['Cohort 2014'] != 0:
        df.at[index, 'rate 2014'] = row['persist 2014'] / row['Cohort 2014']
    
    if row['persist 2015'] != 0 and row['Cohort 2015'] != 0:
        df.at[index, 'rate 2015'] = row['persist 2015'] / row['Cohort 2015']
    
    if row['persist 2016'] != 0 and row['Cohort 2016'] != 0:
        df.at[index, 'rate 2016'] = row['persist 2016'] / row['Cohort 2016']

In [34]:
df.head()

,Institution,persist 2014,persist 2015,persist 2016,Cohort 2014,Cohort 2015,Cohort 2016,rate 2014,rate 2015,rate 2016
0,Angelo State University,798.0,889.0,949.0,1285.0,1336.0,1452.0,0.621012,0.665419,0.653581
1,Lamar University,828.0,963.0,931.0,1411.0,1505.0,1457.0,0.586818,0.639867,0.638984
2,Midwestern State University,573.0,571.0,477.0,834.0,818.0,728.0,0.687050,0.698044,0.655220
3,Prairie View A&M University,1060.0,1118.0,1296.0,1602.0,1614.0,1834.0,0.661673,0.692689,0.706652
4,Sam Houston State University,1940.0,1917.0,2036.0,2449.0,2514.0,2667.0,0.792160,0.762530,0.763405

In [35]:
rate_200_214 = pd.read_excel('rate200-214.xlsx')

In [38]:
rate_12_14 = rate_200_214[['Institution','(Fall 2012)','(Fall 2013)','(Fall 2014)']]

In [39]:
rate_12_14.head()

,Institution,(Fall 2012),(Fall 2013),(Fall 2014)
0,The University of Texas at Arlington,0.702,0.680,0.702
1,The University of Texas at Austin,0.935,0.930,0.935
2,The University of Texas at Brownsville,0.651,0.711,0.000
3,The University of Texas at Dallas,0.880,0.864,0.826
4,The University of Texas at El Paso,0.699,0.676,0.718

In [40]:
rate_15_16 = df[['Institution', 'rate 2015', 'rate 2016']]

In [43]:
rate_12_16 = pd.merge(rate_12_14,rate_15_16,how='outer',on='Institution')

In [44]:
rate_12_16.head()

,Institution,(Fall 2012),(Fall 2013),(Fall 2014),rate 2015,rate 2016
0,The University of Texas at Arlington,0.702,0.680,0.702,0.691003,0.705314
1,The University of Texas at Austin,0.935,0.930,0.935,0.930706,0.943381
2,The University of Texas at Brownsville,0.651,0.711,0.000,0.000000,0.000000
3,The University of Texas at Dallas,0.880,0.864,0.826,0.865964,0.865795
4,The University of Texas at El Paso,0.699,0.676,0.718,0.742373,0.739348

In [45]:
rate_12_16.columns = ['Institution', "Fall 2012",'Fall 2013','Fall 2014', 'Fall 2015', 'Fall 2016']

In [46]:
state_avg_dict = {'Instituttion': 'Avg TX Public','Fall 2012':0,
                  'Fall 2013':0, 'Fall 2014':0, 'Fall 2015':0,
                  'Fall 2016':0
                 }

In [ ]:
state_avg_dict['Fall 2012'] =